## Terraform Plan

<details>
<summary>Click to expand</summary>

```hcl
random_password.db_password: Refreshing state... [id=none]
google_project_iam_member.backend_secret_accessor: Refreshing state... [id=ciridae-take-home-jose/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_service.run: Refreshing state... [id=ciridae-take-home-jose/run.googleapis.com]
google_project_service.storage: Refreshing state... [id=ciridae-take-home-jose/storage.googleapis.com]
google_project_iam_audit_config.cloudrun: Refreshing state... [id=ciridae-take-home-jose/audit_config/run.googleapis.com]
google_project_iam_member.migrate_secret_accessor: Refreshing state... [id=ciridae-take-home-jose/roles/secretmanager.secretAccessor/serviceAccount:db-migrate-sa@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_service.compute: Refreshing state... [id=ciridae-take-home-jose/compute.googleapis.com]
google_project_service.servicenetworking: Refreshing state... [id=ciridae-take-home-jose/servicenetworking.googleapis.com]
google_project_iam_audit_config.cloudsql: Refreshing state... [id=ciridae-take-home-jose/audit_config/cloudsql.googleapis.com]
google_project_service.vpcaccess: Refreshing state... [id=ciridae-take-home-jose/vpcaccess.googleapis.com]
google_project_iam_audit_config.iam: Refreshing state... [id=ciridae-take-home-jose/audit_config/iam.googleapis.com]
google_project_iam_audit_config.secretmanager: Refreshing state... [id=ciridae-take-home-jose/audit_config/secretmanager.googleapis.com]
google_project_iam_audit_config.storage: Refreshing state... [id=ciridae-take-home-jose/audit_config/storage.googleapis.com]
google_project_service.sqladmin: Refreshing state... [id=ciridae-take-home-jose/sqladmin.googleapis.com]
google_project_service.containerregistry: Refreshing state... [id=ciridae-take-home-jose/containerregistry.googleapis.com]
google_project_service.iamcredentials: Refreshing state... [id=ciridae-take-home-jose/iamcredentials.googleapis.com]
google_iam_workload_identity_pool.github: Refreshing state... [id=projects/ciridae-take-home-jose/locations/global/workloadIdentityPools/github-pool]
google_project_service.secretmanager: Refreshing state... [id=ciridae-take-home-jose/secretmanager.googleapis.com]
google_project_service.dns: Refreshing state... [id=ciridae-take-home-jose/dns.googleapis.com]
google_project_service.iam: Refreshing state... [id=ciridae-take-home-jose/iam.googleapis.com]
google_compute_network.private_network: Refreshing state... [id=projects/ciridae-take-home-jose/global/networks/todo-app-network]
google_secret_manager_secret.database_url: Refreshing state... [id=projects/ciridae-take-home-jose/secrets/database-url]
google_project_service.certificatemanager: Refreshing state... [id=ciridae-take-home-jose/certificatemanager.googleapis.com]
google_secret_manager_secret.db_connection_name: Refreshing state... [id=projects/ciridae-take-home-jose/secrets/database-connection-name]
google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/ciridae-take-home-jose/locations/global/workloadIdentityPools/github-pool/providers/github-provider]
google_compute_managed_ssl_certificate.frontend: Refreshing state... [id=projects/ciridae-take-home-jose/global/sslCertificates/frontend-ssl-cert]
google_project_service.cloudresourcemanager: Refreshing state... [id=ciridae-take-home-jose/cloudresourcemanager.googleapis.com]
google_storage_bucket.frontend: Refreshing state... [id=ciridae-take-home-jose-frontend]
google_dns_managed_zone.main: Refreshing state... [id=projects/ciridae-take-home-jose/managedZones/ciridae-deploy-zone]
google_compute_global_address.frontend_ip: Refreshing state... [id=projects/ciridae-take-home-jose/global/addresses/frontend-ip]
google_secret_manager_secret.db_password: Refreshing state... [id=projects/ciridae-take-home-jose/secrets/database-password]
google_storage_bucket_iam_member.frontend_public: Refreshing state... [id=b/ciridae-take-home-jose-frontend/roles/storage.objectViewer/allUsers]
google_compute_backend_bucket.frontend: Refreshing state... [id=projects/ciridae-take-home-jose/global/backendBuckets/frontend-backend-bucket]
google_dns_record_set.api_cname: Refreshing state... [id=projects/ciridae-take-home-jose/managedZones/ciridae-deploy-zone/rrsets/api.ciridae-deploy.com./CNAME]
google_secret_manager_secret_version.db_password: Refreshing state... [id=projects/523433099302/secrets/database-password/versions/2]
google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/ciridae-take-home-jose/regions/us-central1/subnetworks/todo-app-subnet]
google_compute_firewall.allow_internal: Refreshing state... [id=projects/ciridae-take-home-jose/global/firewalls/allow-internal]
google_compute_firewall.deny_all_ingress: Refreshing state... [id=projects/ciridae-take-home-jose/global/firewalls/deny-all-ingress]
google_vpc_access_connector.backend_connector: Refreshing state... [id=projects/ciridae-take-home-jose/locations/us-central1/connectors/backend-connector]
google_compute_firewall.allow_vpc_connector_to_sql: Refreshing state... [id=projects/ciridae-take-home-jose/global/firewalls/allow-vpc-connector-to-sql]
google_compute_global_address.private_ip_address: Refreshing state... [id=projects/ciridae-take-home-jose/global/addresses/private-ip-address]
google_compute_url_map.https_redirect: Refreshing state... [id=projects/ciridae-take-home-jose/global/urlMaps/https-redirect]
google_compute_url_map.frontend: Refreshing state... [id=projects/ciridae-take-home-jose/global/urlMaps/frontend-lb]
google_dns_record_set.root_a: Refreshing state... [id=projects/ciridae-take-home-jose/managedZones/ciridae-deploy-zone/rrsets/ciridae-deploy.com./A]
google_dns_record_set.www_a: Refreshing state... [id=projects/ciridae-take-home-jose/managedZones/ciridae-deploy-zone/rrsets/www.ciridae-deploy.com./A]
google_compute_target_http_proxy.https_redirect: Refreshing state... [id=projects/ciridae-take-home-jose/global/targetHttpProxies/https-redirect-proxy]
google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Fciridae-take-home-jose%2Fglobal%2Fnetworks%2Ftodo-app-network:servicenetworking.googleapis.com]
google_compute_target_https_proxy.frontend: Refreshing state... [id=projects/ciridae-take-home-jose/global/targetHttpsProxies/frontend-https-proxy]
google_compute_global_forwarding_rule.frontend_http: Refreshing state... [id=projects/ciridae-take-home-jose/global/forwardingRules/frontend-http]
google_compute_global_forwarding_rule.frontend_https: Refreshing state... [id=projects/ciridae-take-home-jose/global/forwardingRules/frontend-https]
google_sql_database_instance.main: Refreshing state... [id=todo-app-db]
google_sql_database.database: Refreshing state... [id=projects/ciridae-take-home-jose/instances/todo-app-db/databases/todos]
google_secret_manager_secret_version.db_connection_name: Refreshing state... [id=projects/523433099302/secrets/database-connection-name/versions/1]
google_sql_user.user: Refreshing state... [id=app_user//todo-app-db]
google_secret_manager_secret_version.database_url: Refreshing state... [id=projects/523433099302/secrets/database-url/versions/3]
google_service_account.backend: Refreshing state... [id=projects/ciridae-take-home-jose/serviceAccounts/backend-sa@ciridae-take-home-jose.iam.gserviceaccount.com]
google_service_account.github_actions: Refreshing state... [id=projects/ciridae-take-home-jose/serviceAccounts/github-actions@ciridae-take-home-jose.iam.gserviceaccount.com]
google_service_account.db_migrate: Refreshing state... [id=projects/ciridae-take-home-jose/serviceAccounts/db-migrate-sa@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.migrate_sql_client: Refreshing state... [id=ciridae-take-home-jose/roles/cloudsql.client/serviceAccount:db-migrate-sa@ciridae-take-home-jose.iam.gserviceaccount.com]
google_cloud_run_v2_job.db_migrate: Refreshing state... [id=projects/ciridae-take-home-jose/locations/us-central1/jobs/db-migrate]
google_service_account_iam_member.github_actions_wif: Refreshing state... [id=projects/ciridae-take-home-jose/serviceAccounts/github-actions@ciridae-take-home-jose.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/523433099302/locations/global/workloadIdentityPools/github-pool/attribute.repository/jadelapuente/deploy-take-home]
google_service_account_iam_member.github_actions_use_migrate_sa: Refreshing state... [id=projects/ciridae-take-home-jose/serviceAccounts/db-migrate-sa@ciridae-take-home-jose.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceAccount:github-actions@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/compute.admin"]: Refreshing state... [id=ciridae-take-home-jose/roles/compute.admin/serviceAccount:github-actions@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/secretmanager.admin"]: Refreshing state... [id=ciridae-take-home-jose/roles/secretmanager.admin/serviceAccount:github-actions@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/dns.admin"]: Refreshing state... [id=ciridae-take-home-jose/roles/dns.admin/serviceAccount:github-actions@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/compute.loadBalancerAdmin"]: Refreshing state... [id=ciridae-take-home-jose/roles/compute.loadBalancerAdmin/serviceAccount:github-actions@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/servicenetworking.networksAdmin"]: Refreshing state... [id=ciridae-take-home-jose/roles/servicenetworking.networksAdmin/serviceAccount:github-actions@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/cloudbuild.builds.editor"]: Refreshing state... [id=ciridae-take-home-jose/roles/cloudbuild.builds.editor/serviceAccount:github-actions@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/cloudsql.admin"]: Refreshing state... [id=ciridae-take-home-jose/roles/cloudsql.admin/serviceAccount:github-actions@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/iam.workloadIdentityPoolAdmin"]: Refreshing state... [id=ciridae-take-home-jose/roles/iam.workloadIdentityPoolAdmin/serviceAccount:github-actions@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/storage.admin"]: Refreshing state... [id=ciridae-take-home-jose/roles/storage.admin/serviceAccount:github-actions@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/serviceusage.serviceUsageAdmin"]: Refreshing state... [id=ciridae-take-home-jose/roles/serviceusage.serviceUsageAdmin/serviceAccount:github-actions@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/artifactregistry.writer"]: Refreshing state... [id=ciridae-take-home-jose/roles/artifactregistry.writer/serviceAccount:github-actions@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/vpcaccess.admin"]: Refreshing state... [id=ciridae-take-home-jose/roles/vpcaccess.admin/serviceAccount:github-actions@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/run.admin"]: Refreshing state... [id=ciridae-take-home-jose/roles/run.admin/serviceAccount:github-actions@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/iam.securityAdmin"]: Refreshing state... [id=ciridae-take-home-jose/roles/iam.securityAdmin/serviceAccount:github-actions@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/certificatemanager.editor"]: Refreshing state... [id=ciridae-take-home-jose/roles/certificatemanager.editor/serviceAccount:github-actions@ciridae-take-home-jose.iam.gserviceaccount.com]
google_project_iam_member.backend_sql_client: Refreshing state... [id=ciridae-take-home-jose/roles/cloudsql.client/serviceAccount:backend-sa@ciridae-take-home-jose.iam.gserviceaccount.com]
google_cloud_run_v2_service.backend: Refreshing state... [id=projects/ciridae-take-home-jose/locations/us-central1/services/backend]
google_service_account_iam_member.github_actions_use_backend_sa: Refreshing state... [id=projects/ciridae-take-home-jose/serviceAccounts/backend-sa@ciridae-take-home-jose.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceAccount:github-actions@ciridae-take-home-jose.iam.gserviceaccount.com]
google_cloud_run_v2_service_iam_member.backend_public: Refreshing state... [id=projects/ciridae-take-home-jose/locations/us-central1/services/backend/roles/run.invoker/allUsers]
google_cloud_run_domain_mapping.api: Refreshing state... [id=locations/us-central1/namespaces/ciridae-take-home-jose/domainmappings/api.ciridae-deploy.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_cloud_run_v2_job.db_migrate_dryrun will be created
  + resource "google_cloud_run_v2_job" "db_migrate_dryrun" {
      + conditions               = (known after apply)
      + create_time              = (known after apply)
      + creator                  = (known after apply)
      + delete_time              = (known after apply)
      + effective_annotations    = (known after apply)
      + effective_labels         = (known after apply)
      + etag                     = (known after apply)
      + execution_count          = (known after apply)
      + expire_time              = (known after apply)
      + generation               = (known after apply)
      + id                       = (known after apply)
      + last_modifier            = (known after apply)
      + latest_created_execution = (known after apply)
      + launch_stage             = (known after apply)
      + location                 = "us-central1"
      + name                     = "db-migrate-dryrun"
      + observed_generation      = (known after apply)
      + project                  = "ciridae-take-home-jose"
      + reconciling              = (known after apply)
      + terminal_condition       = (known after apply)
      + terraform_labels         = (known after apply)
      + uid                      = (known after apply)
      + update_time              = (known after apply)

      + template {
          + parallelism = (known after apply)
          + task_count  = 1

          + template {
              + execution_environment = (known after apply)
              + max_retries           = 1
              + service_account       = "db-migrate-sa@ciridae-take-home-jose.iam.gserviceaccount.com"
              + timeout               = "600s"

              + containers {
                  + args    = [
                      + "-c",
                      + "/app/.venv/bin/alembic check && /app/.venv/bin/alembic upgrade head",
                    ]
                  + command = [
                      + "/bin/sh",
                    ]
                  + image   = "gcr.io/cloudrun/placeholder"

                  + env {
                      + name  = "ENVIRONMENT"
                      + value = "prod"
                    }
                  + env {
                      + name  = "GOOGLE_CLOUD_PROJECT"
                      + value = "ciridae-take-home-jose"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "int-deploytakehome"
                    }
                  + env {
                      + name  = "AUTH_SERVICE_BACKEND_URL"
                      + value = "https://api.auth.sandbox.ciridae.app"
                    }
                  + env {
                      + name = "DATABASE_URL"

                      + value_source {
                          + secret_key_ref {
                              + secret  = "database-url"
                              + version = "latest"
                            }
                        }
                    }
                  + env {
                      + name  = "DB_INSTANCE_CONNECTION_NAME"
                      + value = "ciridae-take-home-jose:us-central1:todo-app-db"
                    }
                  + env {
                      + name  = "ALEMBIC_DRY_RUN"
                      + value = "true"
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1000m"
                          + "memory" = "512Mi"
                        }
                    }

                  + volume_mounts {
                      + mount_path = "/cloudsql"
                      + name       = "cloudsql"
                    }
                }

              + volumes {
                  + name = "cloudsql"

                  + cloud_sql_instance {
                      + instances = [
                          + "ciridae-take-home-jose:us-central1:todo-app-db",
                        ]
                    }
                }

              + vpc_access {
                  + connector = "projects/ciridae-take-home-jose/locations/us-central1/connectors/backend-connector"
                  + egress    = "PRIVATE_RANGES_ONLY"
                }
            }
        }
    }

  # google_project_iam_member.backend_secret_accessor will be destroyed
  # (because google_project_iam_member.backend_secret_accessor is not in configuration)
  - resource "google_project_iam_member" "backend_secret_accessor" {
      - etag    = "BwZHcJNDhgU=" -> null
      - id      = "ciridae-take-home-jose/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@ciridae-take-home-jose.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:backend-sa@ciridae-take-home-jose.iam.gserviceaccount.com" -> null
      - project = "ciridae-take-home-jose" -> null
      - role    = "roles/secretmanager.secretAccessor" -> null
    }

  # google_project_iam_member.migrate_secret_accessor will be destroyed
  # (because google_project_iam_member.migrate_secret_accessor is not in configuration)
  - resource "google_project_iam_member" "migrate_secret_accessor" {
      - etag    = "BwZHcJNDhgU=" -> null
      - id      = "ciridae-take-home-jose/roles/secretmanager.secretAccessor/serviceAccount:db-migrate-sa@ciridae-take-home-jose.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:db-migrate-sa@ciridae-take-home-jose.iam.gserviceaccount.com" -> null
      - project = "ciridae-take-home-jose" -> null
      - role    = "roles/secretmanager.secretAccessor" -> null
    }

  # google_secret_manager_secret_iam_member.backend_db_url will be created
  + resource "google_secret_manager_secret_iam_member" "backend_db_url" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:backend-sa@ciridae-take-home-jose.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "database-url"
    }

  # google_secret_manager_secret_iam_member.migrate_db_url will be created
  + resource "google_secret_manager_secret_iam_member" "migrate_db_url" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:db-migrate-sa@ciridae-take-home-jose.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "database-url"
    }

Plan: 3 to add, 0 to change, 2 to destroy.
```

</details>